Repository: MGianetti/qhoras-reservation-adm
Catalog: src/infraestructure/i18n/locales/*.po
Languages: pt

source: validation.capacityInteger
pt: A capacidade deve ser um número inteiro.

source: validation.capacityPositive
pt: A capacidade deve ser um número positivo.

source: validation.endDateMin
pt: A data final deve ser maior ou igual à data inicial

source: validation.passwordMinLength
pt: A senha deve ter no mínimo 8 caracteres

source: validation.passwordPattern
pt: A senha deve ter no mínimo 8 caracteres, contendo letras e números.

source: validation.passwordRequired
pt: A senha é obrigatória

source: clients.columnActions
pt: Ações

source: validation.agendaConfigMin
pt: Adicione pelo menos uma configuração de agenda.

source: common.updatedAppointmentSuccess
pt: Agendamento atualizado com sucesso!

source: common.createdAppointmentSuccess
pt: Agendamento criado com sucesso!

source: common.deletedAppointmentSuccess
pt: Agendamento excluído com sucesso!

source: common.refreshCalendarSuccess
pt: Agendamentos atualizados com sucesso!

source: validation.passwordsMatch
pt: As senhas não correspondem

source: table.statusActive
pt: Ativo

source: common.deletedCalendarBlockSuccess
pt: Bloqueio removido com sucesso!

# main nav
source: nav.calendario
pt: Calendário

source: nav.calendar
pt: Calendário

source: table.header.capacity
pt: Capacidade

source: common.createdCalendarBlockSuccess
pt: Caso não haja conflito de horário, o bloqueio foi criado com sucesso!

source: common.updatedClientSuccess
pt: Cliente atualizado com sucesso!

source: common.createdClientSuccess
pt: Cliente criado com sucesso!

# main nav
source: nav.configuracoes
pt: Configurações

source: common.updatedUserConfigSuccess
pt: Configurações atualizadas com sucesso!

source: validation.confirmPasswordRequired
pt: Confirmação de senha é obrigatória

source: nav.copyLinkButton
pt: Copiar link

source: tooltip.copyCalendarLink
pt: Copiar link para o calendário

source: common.companyUpdatedSuccess
pt: Dados da empresa atualizados com sucesso!

source: validation.initialDateRequired
pt: Data inicial é obrigatória

source: validation.capacityRequired
pt: Digite a capacidade da sala.

source: validation.nameRequired
pt: Digite o nome da sala.

source: validation.clientNameRequired
pt: Digite o nome do cliente.

source: validation.priceRequired
pt: Digite o preço da sala.

source: validation.clientPhoneRequired
pt: Digite o telefone do cliente.

source: validation.emailInvalid
pt: Digite um email válido

source: validation.capacityNumeric
pt: Digite um valor numérico para a capacidade.

source: config.sunday
pt: Domingo

source: common.daySunday
pt: Domingo

source: common.requestGetUserFail
pt: Erro ao buscar dados. Tente novamente.

source: common.hasLoginFail
pt: Erro ao efetuar login. Tente novamente.

source: common.resetNewPasswordFail
pt: Erro ao resetar senha! Verifique os dados informados.

source: common.requestPasswordResetFail
pt: Erro ao solicitar! Por favor, tente novamente.

source: nav.linkCopyError
pt: Erro ao copiar link!

source: common.updatedAppointmentFail
pt: Falha ao atualizar agendamento!

source: common.updatedClientFail
pt: Falha ao atualizar cliente!

source: common.updatedUserConfigFail
pt: Falha ao atualizar configurações!

source: common.companyUpdatedFail
pt: Falha ao atualizar dados da empresa!

source: auth.tokenRefreshFail
pt: Falha ao atualizar o token. Por favor, faça login novamente.

source: common.updatedRoomFail
pt: Falha ao atualizar sala!

source: common.createdAppointmentFail
pt: Falha ao criar agendamento!

source: common.createdCalendarBlockFail
pt: Falha ao criar bloqueio!

source: common.createdClientFail
pt: Falha ao criar cliente!

source: common.createdRoomFail
pt: Falha ao criar sala!

source: common.deletedRoomFail
pt: Falha ao deletar sala!

source: common.deletedAppointmentFail
pt: Falha ao excluir agendamento!

source: common.deletedCalendarBlockFail
pt: Falha ao remover bloqueio!

source: clients.image
pt: Imagem

source: table.statusInactive
pt: Inativo

source: nav.linkShort
pt: Link

source: nav.linkCopied
pt: Link copiado com sucesso!

source: common.hasLoginSuccess
pt: Login efetuado com sucesso!

source: nav.logout
pt: Sair

# main nav
source: nav.membros
pt: Membros

source: table.header.name
pt: Nome

source: clients.columnName
pt: Nome

source: validation.emailRequired
pt: O email é obrigatório

source: validation.timeRangeInvalid
pt: O horário final deve ser maior que o horário inicial

source: common.appointmentConflict
pt: O horário selecionado conflita com outro agendamento.

source: common.appointmentOutsideBusinessHours
pt: O horário selecionado está fora do horário de funcionamento.

source: tooltip.openCalendar
pt: Abrir calendário

source: table.capacitySuffix
pt: pessoas

source: config.wednesday
pt: Quarta-feira

source: common.dayWednesday
pt: Quarta-feira

source: config.thursday
pt: Quinta-feira

source: common.dayThursday
pt: Quinta-feira

source: config.saturday
pt: Sábado

source: common.daySaturday
pt: Sábado

source: common.updatedRoomSuccess
pt: Sala atualizada com sucesso!

source: common.createdRoomSuccess
pt: Sala criada com sucesso!

source: common.deletedRoomSuccess
pt: Sala deletada com sucesso!

# main nav
source: nav.salas
pt: Salas

source: config.save
pt: Salvar

source: common.requestPasswordResetSuccess
pt: Se esse email existir na base, confira sua caixa de entrada.

source: config.monday
pt: Segunda-feira

source: common.dayMonday
pt: Segunda-feira

source: validation.startTimeRequired
pt: Selecione a hora de início.

source: validation.endTimeRequired
pt: Selecione a hora de término.

source: validation.dayRequired
pt: Selecione o dia.

source: clients.noReservations
pt: Sem reservas

source: validation.passwordRequired2
pt: Senha é obrigatória

source: common.resetNewPasswordSuccess
pt: Senha resetada com sucesso!

source: config.friday
pt: Sexta-feira

source: common.dayFriday
pt: Sexta-feira

source: table.header.status
pt: Status

source: common.passwordResetSuccess
pt: Sua senha foi alterada com sucesso.

source: table.header.price
pt: Taxa

source: clients.columnPhone
pt: Telefone

source: config.tuesday
pt: Terça-feira

source: common.dayTuesday
pt: Terça-feira

source: clients.columnLastReservation
pt: Última Reserva
